//  Создайте консольное приложение, в котором будет происходить сортировка списка фамилий из пяти человек.
//  Сортировка должна происходить при помощи события.
//  Сортировка происходит при введении пользователем либо числа 1 (сортировка А-Я), либо числа 2 (сортировка Я-А).

//  Дополнительно реализуйте проверку введённых данных от пользователя через конструкцию TryCatchFinally с использованием собственного типа исключения.

#region Up-level
List<string> peoples = new List<string> {"Смирнов", "Уткин", "Жуков", "Маслов", "Носов"};
#endregion

